luckyCharm1123/STM32_LED/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body 主程序主体
  * @details        : This file contains the main application code for the STM32 LED
  *                  blinking project with USART2 serial communication.
  *                  本文件包含STM32 LED闪烁和串口通信项目的主应用程序代码。
  *                  USART2 configured on PA2(TX) and PA3(RX) pins at 115200 baud.
  *                  USART2配置在PA2(TX)和PA3(RX)引脚，波特率115200。
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  * @par Project Context 项目背景
  * - MCU: STM32F103xB (ARM Cortex-M3)
  * - IDE: STM32CubeIDE / CMake
  * - Purpose: LED blinking + USART2 serial communication
  * - 目的：LED闪烁 + USART2串口通信
  * - USART2: 115200 8N1, TX=PA2, RX=PA3
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal_def.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
/* 用户代码开始：包含头文件 */
#include <stdio.h>  // 用于printf重定向，实现标准输出到串口
#include <string.h> // 用于字符串操作，如strlen、strncmp、memset等
#include <stdlib.h> // 用于atoi函数，字符串转整数
#include "esp.h"    // ESP-01S模块驱动
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* 用户代码开始：私有类型定义 */
/* 可以在此处定义自定义的数据结构类型 */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* 用户代码开始：私有定义 */
#define RX_BUFFER_SIZE 128  // 接收缓冲区大小，最大可接收127个字符+1个结束符
#define TX_BUFFER_SIZE 128  // 发送缓冲区大小，预留128字节
#define ESP_RX_BUFFER_SIZE 512  // ESP接收缓冲区大小（与esp.c中一致）

/* WiFi配置 - 请修改为您的WiFi信息 */
#define WIFI_SSID     "1901"      // WiFi名称
#define WIFI_PASSWORD "qjdq1901"  // WiFi密码

/* MQTT配置 */
#define MQTT_CLIENT_ID "kaiyueT01"  // MQTT客户端ID
#define MQTT_USERNAME  "test"       // MQTT用户名
#define MQTT_PASSWORD  "supertest"  // MQTT密码

/* MQTT服务器配置 */
#define MQTT_SERVER    "156.233.227.40"  // MQTT服务器地址
#define MQTT_PORT      1588               // MQTT服务器端口
#define MQTT_SSL       0                  // SSL标志 (0=不启用, 1=启用)

/* MQTT主题和消息配置 */
#define MQTT_SUBSCRIBE_TOPIC  "testtopic1"  // 订阅的主题
#define MQTT_PUBLISH_TOPIC   "testtopic2"  // 发布的主题
#define MQTT_PUBLISH_MESSAGE "hello"        // 发布的消息内容
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* 用户代码开始：私有宏定义 */
/* 可以在此处定义自定义宏 */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* 私有变量 */
UART_HandleTypeDef huart1;  // USART1句柄，用于调试输出（PA9/PA10，115200）
UART_HandleTypeDef huart2;  // USART2句柄，用于管理串口2的所有操作

/* USER CODE BEGIN PV */
/* 用户代码开始：私有变量 */

/* 串口接收相关变量 */
uint8_t rx_buffer[RX_BUFFER_SIZE];  // 接收缓冲区，存储从串口接收到的数据
uint8_t tx_buffer[TX_BUFFER_SIZE];  // 发送缓冲区，预留用于复杂发送场景
uint16_t rx_index = 0;              // 接收索引，指示当前接收数据在缓冲区中的位置
uint8_t rx_complete = 0;            // 接收完成标志，0=正在接收，1=接收完成等待处理

/* ESP模式控制变量 */
uint8_t esp_mode = 0;               // ESP模式标志，用于切换接收处理逻辑
                                    // 0 = 用户命令模式（处理用户输入的控制命令）
                                    // 1 = ESP数据模式（直接接收ESP模块的响应数据）

/* ESP相关外部变量声明（在esp.c中定义） */
extern uint8_t esp_rx_buffer[512];  // ESP接收缓冲区，用于存储ESP模块返回的原始数据
extern uint8_t esp_rx_complete;     // ESP接收完成标志，当收到换行符时置1
extern uint16_t esp_rx_index;       // ESP接收索引，指示当前ESP数据在缓冲区中的位置
extern uint8_t esp_response_ready;  // ESP响应就绪标志，表示ESP数据已准备好供驱动层处理
extern uint32_t esp_last_rx_time;   // ESP最后接收时间戳
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);  // 系统时钟配置函数声明
static void MX_GPIO_Init(void); // GPIO初始化函数声明（静态函数，仅在本文件内可见）
static void MX_USART1_UART_Init(void); // USART1初始化函数声明（调试串口）
static void MX_USART2_UART_Init(void); // USART2初始化函数声明

/* USER CODE BEGIN PFP */
/* 用户代码开始：私有函数原型 */
int _write(int file, char *ptr, int len);  // 重定向printf函数原型，用于printf到串口
void DEBUG_SendString(char *str);          // USART1调试串口发送函数原型
void USART2_SendString(char *str);         // 串口发送字符串函数原型
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* 私有用户代码 */
/* USER CODE BEGIN 0 */
/* 用户代码开始：第0区 */

/**
  * @brief 重定向printf到USART2
  * @param file: 文件描述符（标准输出为1）
  * @param ptr: 数据指针，指向要发送的数据
  * @param len: 数据长度，要发送的字节数
  * @retval 返回发送的数据长度
  * @details 重写C库函数_write，使printf等标准输出函数能输出到串口
  *          这是ARM GCC编译器的标准做法，用于重定向标准输出
  */
int _write(int file, char *ptr, int len)
{
  // 使用HAL库的UART阻塞发送函数
  // &huart2: USART2句柄
  // (uint8_t*)ptr: 数据指针，需要转换为uint8_t*
  // len: 数据长度
  // HAL_MAX_DELAY: 最大等待时间，表示一直等待直到发送完成
  HAL_UART_Transmit(&huart2, (uint8_t*)ptr, len, HAL_MAX_DELAY);
  
  // 返回发送的字节数，表示成功
  return len;
}

/**
  * @brief USART2发送字符串
  * @param str: 要发送的字符串，以'\0'结尾
  * @retval None
  * @details 封装了字符串发送功能，自动计算字符串长度
  *          使用阻塞方式发送，确保数据完整发送
  */
void USART2_SendString(char *str)
{
  // strlen计算字符串长度（不包括结束符）
  // HAL_UART_Transmit使用阻塞模式发送
  HAL_UART_Transmit(&huart2, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

/**
  * @brief USART1发送调试信息
  * @param str: 要发送的调试字符串，以'\0'结尾
  * @retval None
  * @details USART1专用调试串口，配置在PA9(TX)/PA10(RX)
  *          波特率115200，用于输出系统调试信息
  */
void DEBUG_SendString(char *str)
{
  HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

/**
  * @brief 处理接收到的数据
  * @param None
  * @retval None
  * @details 这是主循环中调用的核心处理函数
  *          当接收到完整命令后，解析并执行相应操作
  *          支持的命令包括：LED控制命令和系统信息查询
  */
void Process_Received_Data(void)
{
  // 检查接收完成标志
  if(rx_complete)
  {
    // 回显接收到的数据，让用户看到自己输入的内容
    USART2_SendString("\r\nReceived: ");
    HAL_UART_Transmit(&huart2, rx_buffer, rx_index, HAL_MAX_DELAY);
    USART2_SendString("\r\n");
    
    // 简单的命令处理 - 使用strncmp进行字符串比较
    // strncmp比较前n个字符，防止缓冲区溢出
    
    // 检查LED_ON命令 - 打开LED
    // 用法：在串口输入"LED_ON"
    if(strncmp((char*)rx_buffer, "LED_ON", 6) == 0)
    {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_SET);  // 设置LED引脚为高电平（点亮）
      USART2_SendString("LED turned ON\r\n");
    }
    
    // 检查LED_OFF命令 - 关闭LED
    // 用法：在串口输入"LED_OFF"
    else if(strncmp((char*)rx_buffer, "LED_OFF", 7) == 0)
    {
      HAL_GPIO_WritePin(LED_GPIO_Port, LED_Pin, GPIO_PIN_RESET);  // 设置LED引脚为低电平（熄灭）
      USART2_SendString("LED turned OFF\r\n");
    }
    
    // 检查LED_TOGGLE命令 - 翻转LED状态
    // 用法：在串口输入"LED_TOGGLE"
    else if(strncmp((char*)rx_buffer, "LED_TOGGLE", 10) == 0)
    {
      HAL_GPIO_TogglePin(LED_GPIO_Port, LED_Pin);  // 翻转LED引脚电平
      USART2_SendString("LED toggled\r\n");
    }
    
    // 检查STATUS命令 - 显示系统状态
    // 用法：输入"STATUS"
    else if(strncmp((char*)rx_buffer, "STATUS", 6) == 0)
    {
      USART2_SendString("=== System Status ===\r\n");
      USART2_SendString("STM32F103xB - USART2 Demo\r\n");
      USART2_SendString("Baud Rate: 115200\r\n");
      USART2_SendString("LED: PA5 (or user LED)\r\n");
      USART2_SendString("Commands: LED_ON, LED_OFF, LED_TOGGLE, STATUS, HELP\r\n");
    }
    
    // 检查HELP命令 - 显示帮助信息
    // 用法：输入"HELP"
    else if(strncmp((char*)rx_buffer, "HELP", 4) == 0)
    {
      USART2_SendString("=== Available Commands ===\r\n");
      USART2_SendString("LED_ON      - Turn on LED\r\n");
      USART2_SendString("LED_OFF     - Turn off LED\r\n");
      USART2_SendString("LED_TOGGLE  - Toggle LED state\r\n");
      USART2_SendString("STATUS      - Show system status\r\n");
      USART2_SendString("HELP        - Show this help message\r\n");
    }
    
    // 未知命令处理
    // 当用户输入不支持的命令时，显示可用命令列表
    else
    {
      USART2_SendString("Unknown command. Type HELP for available commands.\r\n");
    }
    
